# Guía práctica para aprender Pandas
Este notebook te ayudará a entender las operaciones básicas con `pandas`, usando un ejemplo práctico.

## 1. Inspección inicial del DataFrame

In [1]:
import pandas as pd

# Cargar datos desde un archivo CSV
df = pd.read_csv('../datasets/datos_empleados.csv')
df.head()

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
1    Luis    35  Guadalajara    15000    Marketing
2  Carlos    45    Monterrey    18000       Ventas
3   Lucía    25         CDMX    12500           TI
4   Marta    30       Puebla    14000           TI

## 2. Estructura y resumen del DataFrame

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        7 non-null      object
 1   Edad          7 non-null      int64
 2   Ciudad        7 non-null      object
 3   Salario       7 non-null      int64
 4   Departamento  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [3]:
df.describe()

            Edad       Salario
count   7.000000      7.000000
mean   31.142857  14285.714286
std     7.335498   2078.804602
min    23.000000  12000.000000
25%    26.500000  12750.000000
50%    30.000000  14000.000000
75%    33.500000  15250.000000
max    45.000000  18000.000000

## 3. Selección de columnas

In [4]:
df['Edad']

0    23
1    35
2    45
3    25
4    30
5    28
6    32
Name: Edad, dtype: int64

In [5]:
df[['Nombre', 'Salario']]

   Nombre  Salario
0     Ana    12000
1    Luis    15000
2  Carlos    18000
3   Lucía    12500
4   Marta    14000
5   Jorge    13000
6   Sofía    15500

## 4. Filtrado de filas
Por ejemplo, trabajadores en CDMX

In [6]:
df[df['Ciudad'] == 'CDMX']

  Nombre  Edad Ciudad  Salario Departamento
0    Ana    23   CDMX    12000       Ventas
3  Lucía    25   CDMX    12500           TI
5  Jorge    28   CDMX    13000    Marketing

## 5. Filtrado con múltiples condiciones
Trabajadores de CDMX y del área de TI

In [7]:
df[(df['Ciudad'] == 'CDMX') & (df['Departamento'] == 'TI')]

  Nombre  Edad Ciudad  Salario Departamento
3  Lucía    25   CDMX    12500           TI

## 6. Ordenar filas por salario

In [8]:
df.sort_values(by='Salario', ascending=False)

   Nombre  Edad       Ciudad  Salario Departamento
2  Carlos    45    Monterrey    18000       Ventas
6   Sofía    32  Guadalajara    15500       Ventas
1    Luis    35  Guadalajara    15000    Marketing
4   Marta    30       Puebla    14000           TI
5   Jorge    28         CDMX    13000    Marketing
3   Lucía    25         CDMX    12500           TI
0     Ana    23         CDMX    12000       Ventas

## 7. Crear nuevas columnas
Por ejemplo, salario anual

In [ ]:
df['SalarioAnual'] = df['Salario'] * 12
df.head()

## 8. Conversión de tipos de datos
A veces es necesario convertir columnas a otro tipo de dato, por ejemplo, 'Edad' a float.

In [10]:
df['Edad'] = df['Edad'].astype(float)
df.dtypes

Nombre           object
Edad            float64
Ciudad           object
Salario           int64
Departamento     object
dtype: object

## 9. Filtrado avanzado: por rango de edad

In [9]:
df[(df['Edad'] >= 25) & (df['Edad'] <= 35)]

  Nombre  Edad       Ciudad  Salario Departamento
1   Luis    35  Guadalajara    15000    Marketing
3  Lucía    25         CDMX    12500           TI
4  Marta    30       Puebla    14000           TI
5  Jorge    28         CDMX    13000    Marketing
6  Sofía    32  Guadalajara    15500       Ventas

## 10. Filtrado avanzado: por múltiples ciudades

In [11]:
df[df['Ciudad'].isin(['CDMX', 'Guadalajara'])]

  Nombre  Edad       Ciudad  Salario Departamento
0    Ana  23.0         CDMX    12000       Ventas
1   Luis  35.0  Guadalajara    15000    Marketing
3  Lucía  25.0         CDMX    12500           TI
5  Jorge  28.0         CDMX    13000    Marketing
6  Sofía  32.0  Guadalajara    15500       Ventas

## 11. Filtrado por nombres que empiezan con una letra
Usamos `.str.startswith()`

In [12]:
df[df['Nombre'].str.startswith('L')]

  Nombre  Edad       Ciudad  Salario Departamento
1   Luis  35.0  Guadalajara    15000    Marketing
3  Lucía  25.0         CDMX    12500           TI

## 12. Agrupaciones
Agrupar por 'Departamento' y obtener el salario promedio.

In [13]:
df.groupby('Departamento')['Salario'].mean()

Departamento
Marketing    14000.000000
TI           13250.000000
Ventas       15166.666667
Name: Salario, dtype: float64

## 13. Eliminación de duplicados
Vamos a duplicar un registro y luego eliminarlo.

In [ ]:
df = pd.concat([df, df.iloc[[0]]])  # duplicamos
print('Antes de eliminar duplicados:', len(df))
df = df.drop_duplicates()
print('Después de eliminar duplicados:', len(df))

## 14. Tablas dinámicas (Pivot Tables)
Resumen de salario promedio por ciudad y departamento.

In [ ]:
df.pivot_table(values='Salario', index='Ciudad', columns='Departamento', aggfunc='mean', fill_value=0)

## 15. Segmentación e indexación de DataFrames
Usamos `.loc[]` y `.iloc[]` para acceder a partes del DataFrame.

In [ ]:
df.loc[0:2, ['Nombre', 'Salario']]  # por etiquetas
# También con iloc (por posiciones)
df.iloc[0:3, 0:2]

## 16. Manejo de valores ausentes
Agregamos valores nulos y mostramos cómo detectarlos.

In [ ]:
df.loc[1, 'Salario'] = None

# Detectar valores nulos
df.isnull().sum()

## 17. Eliminación de valores ausentes

In [ ]:
df_sin_nulos = df.dropna()
df_sin_nulos

## 18. Sustitución de valores ausentes

In [ ]:
df['Salario'] = df['Salario'].fillna(df['Salario'].mean())
df.head()

## 19. Visualización de datos con Matplotlib
Utilizaremos `matplotlib` para crear algunos gráficos básicos que nos ayuden a visualizar la información del DataFrame.

In [ ]:
import matplotlib.pyplot as plt
%matplotlib inline

### Histograma de edades

In [ ]:
plt.hist(df['Edad'], bins=5, color='skyblue', edgecolor='black')
plt.title('Distribución de edades')
plt.xlabel('Edad')
plt.ylabel('Frecuencia')
plt.show()

### Gráfico de barras: Salario por persona

In [ ]:
plt.figure(figsize=(10, 5))
plt.bar(df['Nombre'], df['Salario'], color='green')
plt.title('Salario por persona')
plt.xlabel('Nombre')
plt.ylabel('Salario')
plt.xticks(rotation=45)
plt.tight_layout()
plt.show()

### Gráfico circular: Distribución por departamento

In [ ]:
df['Departamento'].value_counts().plot.pie(autopct='%1.1f%%', figsize=(6,6))
plt.title('Distribución de empleados por departamento')
plt.ylabel('')
plt.show()

## 20. Uso de la función `.agg()` en Pandas
La función `.agg()` permite aplicar una o más funciones de agregación sobre columnas específicas de un DataFrame o luego de una agrupación con `groupby()`.

### Agregación simple a todo el DataFrame

In [ ]:
df.agg(['mean', 'max'])

### Agregación personalizada por columna

In [ ]:
df.agg({
    'Edad': ['mean', 'min'],
    'Salario': ['sum', 'max']
})

### Agregación después de agrupar con `groupby()`

In [ ]:
df.groupby('Departamento').agg({
    'Salario': ['mean', 'min', 'max'],
    'Edad': 'median'
})

## 🧠 Ejercicios prácticos con `.agg()`
Pon en práctica lo aprendido con estos ejercicios.

### Ejercicio 1: Promedio de edad y salario
Usa `.agg()` para obtener el promedio de edad y salario del DataFrame.

In [ ]:
# Escribe tu código aquí
df.agg({'Edad': 'mean', 'Salario': 'mean'})

### Ejercicio 2: Agrupa por 'Ciudad' y muestra el salario mínimo y máximo usando `.agg()`

In [ ]:
# Escribe tu código aquí
df.groupby('Ciudad').agg({'Salario': ['min', 'max']})

### Ejercicio 3: Agrupa por 'Departamento' y calcula:
- Edad promedio
- Salario total
- Salario máximo

In [ ]:
# Escribe tu código aquí
df.groupby('Departamento').agg({
    'Edad': 'mean',
    'Salario': ['sum', 'max']
})